{
    "projects" : [
        {
            "image" : "images/projects/work1.jpg",
            "title": "To-Do List",
            "bodyText": "- To-Do List App developed using Python and tkinter\n - A basic app that allows users to add tasks and delete them once completed.",
            "links": [
                {
                    "text": "GitHub",
                    "href": "https://github.com/Sumitkatkam/CodSoft-Task-1"
                }
            ],
            "tags" : [
                "Python",
                "To-Do List App",
                "Tkinter Module"
            ]
        },
        {
            "image" : "images/projects/work2.jpg",
            "title": "Contact Book Application",
            "bodyText": "- Contact Book Application developed using Python and tkinter.\n - This application enables users to manage contacts efficiently with features for adding, viewing, searching, updating, and deleting contacts.",
            "links": [
                {
                    "text": "GitHub",
                    "href": "https://github.com/Sumitkatkam/CodSoft-Task-2"
                }
            ],
            "tags" : [
                "Python",
                "Contact Book",
                "Tkinter Module"
            ]
        },
        {
            "image" : "images/projects/work3.jpg",
            "title": "Password Generator",
            "bodyText": "- Password Generator developed using Python and tkinter.\n - Generates passwords based on user-defined length, incorporating a mix of alphabets, numbers, and symbols.",
            "links": [
                {
                    "text": "GitHub",
                    "href": "https://github.com/Sumitkatkam/CodSoft-Task-3"
                }
            ],
            "tags" : [
                "Python",
                "Password Generator",
                "Tkinter Module"
            ]
        },
        {
            "image" : "images/projects/work4.jpg",
            "title": "Hangman Game",
            "bodyText": "- Developed using Python, this interactive game challenges players to guess a randomly selected word from a list that includes 'apple', 'banana', 'orange', and more.\n - Players have a limited number of attempts to guess letters correctly. Incorrect guesses lead to the gradual drawing of a 'hangman' figure.\n - Guess all letters correctly before running out of attempts to win!.",
            "links": [
                {
                    "text": "GitHub",
                    "href": "https://github.com/Sumitkatkam/HashCodes-Task-1"
                }
            ],
            "tags" : [
                "Python",
                "Random Module"
            ]
        },
        {
            "image" : "images/projects/work5.jpg",
            "title": "Password Manager",
            "bodyText": "- Developed using Python, this secure application allows users to store and manage passwords for various services.\n - Utilizes AES encryption to safeguard passwords, ensuring sensitive data remains protected from unauthorized access.\n - Features an intuitive command-line interface enabling users to add, retrieve, and delete passwords with ease, enhancing user convenience and data security.",
            "links": [
                {
                    "text": "GitHub",
                    "href": "https://github.com/Sumitkatkam/HashCodes-Task-3"
                }
            ],
            "tags" : [
                "Python",
                "Encryption",
                "Hashing",
                "User Input Handling"
            ]
        },
        {
            "image" : "images/projects/work6.jpg",
            "title": "To-Do List Web Application",
            "bodyText": "- Built using Python and Flask, this web app enables efficient task management with features for adding, prioritizing, and deleting tasks.\n - Prioritize and manage tasks easily with user-defined priority levels. Add, adjust, and delete tasks via a straightforward form interface.\n - Built-in functionality ensures seamless task management. Users can easily add, delete, and prioritize tasks, enhancing productivity and organization in their daily routines.",
            "links": [
                {
                    "text": "GitHub",
                    "href": "https://github.com/Sumitkatkam/HashCodes-Task-4-intermediate"
                }
            ],
            "tags" : [
                "Python Flask",
                "Flask Web Application",
                "Task Management",
                "CRUD Operations"
            ]
        },
        {
            "image" : "images/projects/work7.jpg",
            "title": "Cricket Data Visualization Dashboard",
            "bodyText": "-Developed an interactive data visualization dashboard using Dash and Plotly for ICC World Cup 2007 Indian team performance.\n - Utilized Python and Pandas for data analysis, data visualization dashboard using Dash and Plotly, ensuring accurate and insightful visual representations.\n - Designed a responsive web application, enhancing user experience with dynamic visualizations.",
            "links": [
                {
                    "text": "GitHub",
                    "href": "https://github.com/Sumitkatkam/HasCodes-Task4-intermediate"
                }
            ],
            "tags" : [
                "Python",
                "Data Visulaization",
                "Dash Plotly",
                "Web Development"
            ]
        }
    ]
}
